docs/schedule.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-16 Thu 13:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CSCE 990 (Spring 2020): Software Verification</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu H. Nguyen" />
<link rel="stylesheet" type="text/css" href="https://cse.unl.edu/~tnguyen/css/worg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">CSCE 990 (Spring 2020): Software Verification</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6c055dd">Announcements</a></li>
<li><a href="#org29db716">Reading List</a>
<ul>
<li><a href="#orgd99eaa2">Topic 1: Intro</a></li>
<li><a href="#org3257e2a">Topic 2: Model Checking</a></li>
<li><a href="#org373bdf9">Topic 3: Abstraction / Static Analysis</a></li>
<li><a href="#org165cf70">Topic 4: Symbolic Execution/Test Case Generation</a></li>
<li><a href="#orgdb430b8">Topic 5: Dynamic analysis, Invariant Generation</a></li>
<li><a href="#org4d372c3">Topic 6: Program Synthesis and Repair</a></li>
<li><a href="#org85045b9">Topic 7: Logics/SAT Solving</a></li>
<li><a href="#org1c477a7">Topic 8: Type Systems</a></li>
<li><a href="#orgd35d643">Topic 9: Automated Debugging</a></li>
<li><a href="#org880c787">Additional Resources</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org6c055dd" class="outline-2">
<h2 id="org6c055dd">Announcements</h2>
<div class="outline-text-2" id="text-org6c055dd">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Due</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">T 1/14</td>
<td class="org-left">Syllabus</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">T 2/11</td>
<td class="org-left">No Class (Instructor travel)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>




<div id="outline-container-org29db716" class="outline-2">
<h2 id="org29db716">Reading List</h2>
<div class="outline-text-2" id="text-org29db716">
</div>
<div id="outline-container-orgd99eaa2" class="outline-3">
<h3 id="orgd99eaa2">Topic 1: Intro</h3>
<div class="outline-text-3" id="text-orgd99eaa2">
<ol class="org-ol">
<li>William G. Griswold, <a href="http://cseweb.ucsd.edu/~wgg/CSE210/howtoread.html">How to Read an Engineering Research Paper</a></li>
<li>Mike Hicks, <a href="http://www.pl-enthusiast.net/2014/08/21/advice-reviewing-papers/">Advice on Reviewing Papers</a></li>
<li>Hoare, <a href="https://www.cs.cmu.edu/~crary/819-f09/Hoare69.pdf">Axiomatic Basis for Computer Programming</a> <b>READ NEXT</b></li>
</ol>

<p>
<b>Note</b>: You might want to start by with the <a href="https://en.wikipedia.org/wiki/Hoare_logic">Hoare logic article</a> from Wikipedia.
</p>
</div>
</div>

<div id="outline-container-org3257e2a" class="outline-3">
<h3 id="org3257e2a">Topic 2: Model Checking</h3>
<div class="outline-text-3" id="text-org3257e2a">
<ol class="org-ol">
<li>JHala et al., <a href="./files/SoftwareModelChecking.pdf">Software Model Checking</a>. <b>Chapter 1</b> <b>READ NEXT</b></li>

<li>JHala et al., <a href="./files/SoftwareModelChecking.pdf">Software Model Checking</a>. <b>Chapters 2,3</b></li>
<li><b><b>OPTIONAL</b></b> Visser et al., <a href="https://ti.arc.nasa.gov/m/tech/rse/publications/papers/ASE00/jpf2-ase.pdf">Model Checking Programs</a>. ASE 2003</li>
</ol>
</div>
</div>

<div id="outline-container-org373bdf9" class="outline-3">
<h3 id="org373bdf9">Topic 3: Abstraction / Static Analysis</h3>
<div class="outline-text-3" id="text-org373bdf9">
<ol class="org-ol">
<li>JHala et al., <a href="./files/SoftwareModelChecking.pdf">Software Model Checking</a>. <b>Chapters 4</b></li>
<li>JHala et al., <a href="./files/SoftwareModelChecking.pdf">Software Model Checking</a>. <b>Chapters 5</b></li>
<li>Ball et al., Automatic predicate abstraction of C programs. PLDI, 2001</li>
<li>Mike Hick's post on <a href="http://www.pl-enthusiast.net/2017/10/23/what-is-soundness-in-static-analysis/">Soundness of Static Analysis</a></li>
</ol>
</div>
</div>


<div id="outline-container-org165cf70" class="outline-3">
<h3 id="org165cf70">Topic 4: Symbolic Execution/Test Case Generation</h3>
<div class="outline-text-3" id="text-org165cf70">
<ol class="org-ol">
<li>Baldoni et al., <a href="http://season-lab.github.io/papers/survey-symbolic-execution-preprint-CSUR18.pdf">A Survey of Symbolic Execution Techniques</a></li>
</ol>

<p>
<b>Tool</b>: Java Symbolic PathFinder (SE for Java), KLEE (SE for C)
</p>
</div>
</div>


<div id="outline-container-orgdb430b8" class="outline-3">
<h3 id="orgdb430b8">Topic 5: Dynamic analysis, Invariant Generation</h3>
<div class="outline-text-3" id="text-orgdb430b8">
<ol class="org-ol">
<li>Ernst et al., <a href="https://ece.uwaterloo.ca/~agurfink/ece653w17/assets/pdf/W12-Daikon.pdf">Daikon: Dynamically Discovering Likely Program Invariants</a>. <b><b>Note</b></b>: Just read the slides.</li>
<li>Nguyen et al., <a href="https://cse.unl.edu/~tnguyen/Pub/symtraces_pres.pdf">SymInfer: Inferring Program Invariants using Symbolic States</a>. <b><b>Note</b></b>: Just read the slides.</li>
<li><b><b>OPTIONAL</b></b> Garg et al., Learning invariants using decision trees and implication counterexamples. POPL 2016.</li>
</ol>

<p>
<b>Tool</b>: Daikon, SymInfer
</p>

<p>
<b><b>Optional</b></b>: <a href="http://se.inf.ethz.ch/old/teaching/2009-S/0276/slides/schwab.pdf">http://se.inf.ethz.ch/old/teaching/2009-S/0276/slides/schwab.pdf</a>
</p>
</div>
</div>

<div id="outline-container-org4d372c3" class="outline-3">
<h3 id="org4d372c3">Topic 6: Program Synthesis and Repair</h3>
<div class="outline-text-3" id="text-org4d372c3">
<ol class="org-ol">
<li>Weimer et al., Automatically finding patches using genetic programming. ICSE 2009</li>
<li>Nguyen et al., Connecting Program Synthesis and Reachability: Automatic Program Repair using Test-Input Generation. TACAS 2017.</li>
<li>Gulwani et al., <a href="https://www.microsoft.com/en-us/research/publication/program-synthesis/">Program Synthesis</a>, Chapters 1 and 2</li>
<li>Gulwani et al., <a href="https://www.microsoft.com/en-us/research/publication/program-synthesis/">Program Synthesis</a>, Chapters 3 and 4</li>
</ol>

<p>
<b>Optional</b>: <a href="https://code.fb.com/developer-tools/getafix-how-facebook-tools-learn-to-fix-bugs-automatically/">Facebook's automatic bug fixing</a>
</p>

<p>
<b>Tool</b>: Sketch
</p>
</div>
</div>


<div id="outline-container-org85045b9" class="outline-3">
<h3 id="org85045b9">Topic 7: Logics/SAT Solving</h3>
<div class="outline-text-3" id="text-org85045b9">
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Propositional_calculus">Propositional calculus</a></li>
<li><a href="https://en.wikipedia.org/wiki/Conflict-Driven_Clause_Learning">Conflict Driven Clause Learning</a></li>
<li><a href="https://en.wikipedia.org/wiki/First-order_logic">First-Order Logic</a></li>
<li><a href="https://web.stanford.edu/class/cs357/lectures/lec9.pdf">SMT Solver</a></li>
</ul>

<p>
Optional: Shankar, <a href="http://fm.csl.sri.com/SSFT18/speaklogicV8.pdf">Speaking Logic</a>
</p>

<p>
<b>Tool</b>: Z3
</p>
</div>
</div>

<div id="outline-container-org1c477a7" class="outline-3">
<h3 id="org1c477a7">Topic 8: Type Systems</h3>
<div class="outline-text-3" id="text-org1c477a7">
<ol class="org-ol">
<li>Luca Cardelli, <a href="http://lucacardelli.name/papers/typesystems.pdf">Type Systems</a>, CSUR 1996</li>
</ol>
</div>
</div>

<div id="outline-container-orgd35d643" class="outline-3">
<h3 id="orgd35d643">Topic 9: Automated Debugging</h3>
<div class="outline-text-3" id="text-orgd35d643">
<ol class="org-ol">
<li>James A. Jones et al., <a href="https://www.cc.gatech.edu/~john.stasko/papers/icse02.pdf">Visualization of test information to assist fault localization</a>. ICSE 2002.</li>
<li>Bessey et al., A Few Billion Lines of Code Later: Using Static Analysis to Find Bugs in the Real World. CACM</li>
</ol>

<p>
Optional: 
</p>
<ol class="org-ol">
<li>Andreas Zeller, Yesterday, My Program Worked. Today, It Does Not. Why?. FSE 1999.</li>
<li>Le et al., <a href="http://vuminhle.com/pdf/pldi14-emi.pdf">Compiler Validation via Equivalence Modulo Inputs</a>, PLDI 2014,</li>
</ol>


<p>
<b>Tool</b>: [delta debugging](<a href="http://www.st.cs.uni-saarland.de/dd/">http://www.st.cs.uni-saarland.de/dd/</a>)
</p>
</div>
</div>



<div id="outline-container-org880c787" class="outline-3">
<h3 id="org880c787">Additional Resources</h3>
<div class="outline-text-3" id="text-org880c787">
<ul class="org-ul">
<li>Basic stuff: control flow graph, live/reach defs: <a href="https://www.cs.odu.edu/~zeil/cs350/f18/Public/analysis/index.html">https://www.cs.odu.edu/~zeil/cs350/f18/Public/analysis/index.html</a></li>
<li>Build System: <a href="https://www.cs.odu.edu/~zeil/cs350/f18/Public/make/index.html">https://www.cs.odu.edu/~zeil/cs350/f18/Public/make/index.html</a></li>
<li>Call graphs etc: <a href="http://web.cs.iastate.edu/~weile/cs513x/4.ControlFlowAnalysis.pdf">http://web.cs.iastate.edu/~weile/cs513x/4.ControlFlowAnalysis.pdf</a></li>
<li>Dependency Graph/Slicing: <a href="http://web.cs.iastate.edu/~weile/cs513x/5.DependencySlicing.pdf">http://web.cs.iastate.edu/~weile/cs513x/5.DependencySlicing.pdf</a></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
